# VoltageLineToGround Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysType..::..VoltageLineToGround Property
DistributionSysType Class See Also
---
Get or set line to ground voltage of distribution system type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VoltageType VoltageLineToGround { get; set; }
```

Visual Basic
---
```text
Public Property VoltageLineToGround As VoltageType
	Get
	Set
```

Visual C++
---
```text
public:
property VoltageType^ VoltageLineToGround {
	VoltageType^ get ();
	void set (VoltageType^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The voltage retrieved here is read only and actions to modify its properties it will throw an System.InvalidOperationException. |

# See Also
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace